In [3]:
import pandas as pd
import numpy as np
import requests
import html5lib
import matplotlib
import matplotlib.pyplot as plt

In [5]:
def adquire_new_df():
    dfs = pd.read_html('https://en.wikipedia.org/wiki/The_World%27s_Billionaires')
    data_new = dfs[11]
    data_new.to_csv('../data/processed/prueba_jupyter.csv')
    return data_new
df = adquire_new_df()
data_new = df
df

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Carlos Slim & family,$74.0 billion,71,Mexico,"América Móvil, Grupo Carso"
1,2,Bill Gates,$56.0 billion,55,United States,Microsoft
2,3,Warren Buffett,$50.0 billion,80,United States,Berkshire Hathaway
3,4,Bernard Arnault,$41.0 billion,62,France,LVMH Moët Hennessy • Louis Vuitton
4,5,Larry Ellison,$39.5 billion,66,United States,Oracle Corporation
5,6,Lakshmi Mittal,$31.1 billion,60,India,Arcelor Mittal
6,7,Amancio Ortega,$31.0 billion,74,Spain,Inditex Group
7,8,Eike Batista,$30.0 billion,53,Brazil,EBX Group
8,9,Mukesh Ambani,$27.0 billion,54,India,Reliance Industries
9,10,Christy Walton & family,$26.5 billion,62,United States,Walmart

In [6]:
def adquire_init_df():
    data = pd.read_csv("../data/processed/data.csv", index_col=0)
    return data
data = adquire_init_df()
data

        id    lastName     age  worth_2019_in_BUSD  position
0     2813       bezos    54.0               112.0       1.0
1     8910       gates    62.0                90.0       2.0
2     3919     buffett    87.0                84.0       3.0
3     6449     arnault    69.0                72.0       4.0
4     5032  zuckerberg  1985.0                71.0       5.0
...    ...         ...     ...                 ...       ...
2203  2065        zhao    51.0                 1.0    2204.0
2204  2207        zhou    55.0                 1.0    2205.0
2205  3442         zhu    51.0                 1.0    2206.0
2206  8144        zhuo    52.0                 1.0    2207.0
2207  9807       zorlu    54.0                 1.0    2208.0

[2208 rows x 5 columns]

In [ ]:
"""year = input('Indica un año entre 2017 y 2010:')
year"""

In [ ]:
"""def select_year(str):
    data_year = str
    error = 'ValueError'
    if data_year == '2010':
        data_new = dfs[11]
        return data_new
    elif data_year == '2011':
        data_new = dfs[10]
        return data_new
    elif data_year == '2012':
        data_new = dfs[9]
        return data_new
    elif data_year == '2013':
        data_new = dfs[8]
        return data_new
    elif data_year == '2014':
        data_new = dfs[7]
        return data_new
    elif data_year == '2015':
        data_new = dfs[6]
        return data_new
    elif data_year == '2016':
        data_new = dfs[5]
        return data_new
    elif data_year == '2017':
        data_new = dfs[4]
        return data_new
    else:
        raise ValueError('Value not admited')
 

data_new = select_year(year)
"""

In [7]:
data_new.columns

Index(['No.', 'Name', 'Net worth (USD)', 'Age', 'Nationality',
       'Source(s) of wealth'],
      dtype='object')

In [8]:

def delete_columns(df):
    
    # define valid columns
    valid_columns = ['Name', 'Net worth (USD)']
    # create new df with valid columns
    data_new = df[[x for x in df.columns if x in valid_columns]]
    data_new.rename(columns={'Net worth (USD)': 'Net_worth_(USD)'}, inplace = True)
    return data_new

data_new = delete_columns(data_new)
data_new

/home/emilio/miniconda3/envs/test_env/lib/python3.7/site-packages/pandas/core/frame.py:4238: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(**kwargs)

                      Name Net_worth_(USD)
0     Carlos Slim & family   $74.0 billion
1               Bill Gates   $56.0 billion
2           Warren Buffett   $50.0 billion
3          Bernard Arnault   $41.0 billion
4            Larry Ellison   $39.5 billion
5           Lakshmi Mittal   $31.1 billion
6           Amancio Ortega   $31.0 billion
7             Eike Batista   $30.0 billion
8            Mukesh Ambani   $27.0 billion
9  Christy Walton & family   $26.5 billion

In [ ]:
def replace_text(df):
    df.loc[:,'Net_worth_(USD)'] = df['Net_worth_(USD)'].str.replace('billion', '')
    df.loc[:,'Net_worth_(USD)'] = df['Net_worth_(USD)'].str.replace('$', '')
    df.loc[:,'Name'] = df['Name'].str.replace(' & family', '')
    df.loc[:,'Name'] = df['Name'].str.replace(' ', '_')
    df.rename(columns={'Net_worth_(USD)': 'worth 2010 in BUSD'}, inplace = True)
    return data_new
data_new = replace_text(data_new)
data_new

In [ ]:
data_aux = data_new
name_list = data_aux['Name'].tolist()
name_list

In [ ]:
list_lastName = [i.split('_', 1)[1] for i in name_list] # Delete firstName_
list_lastName

In [ ]:
data_aux['new_column'] = pd.Series(list_lastName).values
data_aux.drop('Name', axis=1, inplace=True)
data_aux.rename(columns={'new_column': 'lastName'}, inplace = True)

data_aux

In [ ]:
"""
def split_column(data_new):
    # new data frame with split value columns
    
    new = data_new['Name'].str.split(' ', n = 1, expand = True) 
 
    # making separate last name column from new data frame
    #data_new['lastName']= new[1]
    
    # Dropping old Name columns
    new.drop(columns =[0], inplace = True)
    #new[1] = new.rename['lastName']
    new.rename(columns={1: 'lastName'}, inplace = True)
    return new
new = split_column(data_new)
new

"""

In [ ]:
"""def join(df1,df2):
    data_new_2 = pd.concat([df1, df2], axis=1, ignore_index=True)
    data_new_2 = df1.join(df2)
    data_new_2.drop(columns =['Name'], inplace = True)
    #df_final = df.drop_duplicates(subset='lastName', keep='first')
    return data_new_2
data_new_2 = join(data_new, data_aux)
data_new_2"""

In [ ]:
def lower_text(df):
    df['lastName'] = df['lastName'].apply(lambda x: x.lower())
    return data_aux

data_aux = lower_text(data_aux)
data_aux

In [ ]:
data_new.info()

In [ ]:
def change_column_type_2(df):
    df['worth 2010 in BUSD'] = df['worth 2010 in BUSD'].astype(float)
    return data_aux
data_aux = change_column_type_2(data_aux)
data_aux.dtypes

In [ ]:
def final_table(df1,df2):
    df = pd.merge(df1, df2, on='lastName')
    df_final = df.drop_duplicates(subset='lastName', keep='first')
    return df_final
df_final = final_table(data, data_aux)
df_final

In [ ]:
# Save first clean table to CSV file
def save_table(df):
    
    df_final.to_csv('../data/processed/df_final.csv')
    

# Call function
save_table(df_final)

In [ ]:
def wealth_difference(df):
    df_final['difference_19_10']= df_final['worth_2019_in_BUSD']- df_final['worth 2010 in BUSD']
    return df_final
df_final = wealth_difference(df_final)
df_final

In [ ]:
title = 'Diference_BUSD'

def visualize(df, title):
   
    barchart = df.plot.bar(x="lastName", y="difference_19_10", 
                rot=70, title=title)
    return barchart

barchart = visualize(df_final, title)

In [ ]:
def save_barchart(barchart):
    fig = barchart.get_figure()
    fig.savefig('../data/results/'+ title + '.pdf')
    return

save_barchart(barchart)